In [1]:
# from https://learn1.open.ac.uk/mod/oublog/viewpost.php?post=181612
import numpy as np

In [2]:
array = np.array([[1, 2, 3,], [4, 5, 6], [7, 8, 9]])
array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [3]:
import pandas as pd
df = pd.DataFrame(array, columns = ['col1', 'col2', 'col3'])
df

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [4]:
import pandas as pd

class person:
    def __init__(self, name, age, notes):
        self.name = name
        self.age = age
        self.notes = notes
    
    # __iter__() acts like a list
    def __iter__(self):
        yield self
        yield self.name
        yield self.age
        yield self.notes
        
    def __str__(self):
        return 'Person: ' + self.name
    
    def hello(self):
        return "Hello! I'm " + self.name + '. ' + self.notes
    
    @classmethod
    def columns(cls):
        return ['Items', 'name', 'age', 'notes']

class struct:
    def __init__(self):
        self.facet = {}
        
    def add_to_facet(self, item):
        self.facet[item.name] = item
    
    @property
    def items(self):
        return pd.DataFrame(list(self.facet.values()), columns=person.columns())

In [5]:
people = struct()
people.add_to_facet(person('Jim', 42, 'The time has come for all good men to come to the aid of the party'))
people.add_to_facet(person('Jane', 24, 'She sells sea shells on the sea shore'))
people.add_to_facet(person('Jill', 17, 'The quick brown fox jumps over the lazy dog'))
print(people.items)

          Items  name  age                                              notes
0   Person: Jim   Jim   42  The time has come for all good men to come to ...
1  Person: Jane  Jane   24              She sells sea shells on the sea shore
2  Person: Jill  Jill   17        The quick brown fox jumps over the lazy dog

In [6]:
people.items

          Items  name  age                                              notes
0   Person: Jim   Jim   42  The time has come for all good men to come to ...
1  Person: Jane  Jane   24              She sells sea shells on the sea shore
2  Person: Jill  Jill   17        The quick brown fox jumps over the lazy dog

In [7]:
df = people.items
obj = df.Items[0]
print(obj.hello())

Hello! I'm Jim. The time has come for all good men to come to the aid of the party

In [8]:
df_dict = {'name':['Jane', 'Jack', 'Kelly', 'Samuel', 'Happy', 'Brian']
           , 'age': [25, 31, 21, 19, 29, 43]
           , 'phone': ['android', 'ios', 'ios', 'ios', 'android', 'ios']
           , 'service': ['att', 'ver', 'att', 'att', 'ver', 'att']
           , 'state': ['ca', 'ca', 'ca', 'wa', 'wa', 'wa']
           , 'contract_year': [2010, 2016, 2012, 2017, 2009, 2018]
          }
phone_df = pd.DataFrame(df_dict)
phone_df

     name  age    phone service state  contract_year
0    Jane   25  android     att    ca           2010
1    Jack   31      ios     ver    ca           2016
2   Kelly   21      ios     att    ca           2012
3  Samuel   19      ios     att    wa           2017
4   Happy   29  android     ver    wa           2009
5   Brian   43      ios     att    wa           2018